# Города и время полета до них в часах
CITIES_AND_FLIGHT_TIME = {
    'Москва': {'Екатеринбург': 2, 'Санкт-Петербург': 1, 'Барнаул': 4, 'Владивосток': 9, 'Самара': 2, 'Крым': 3,
               'Южно-Сахалинск': 9, 'Ростов': 2, 'Киев': 5, 'Минск': 2, 'Баку': 3, 'Ереван': 3, 'Нур-Султан': 4,
               'Душанбе': 4, 'Ташкент': 4, 'Лондон': 4, 'Амстердам': 4, 'Токио': 10, 'Пекин': 15, 'Нью-Дели': 6,
               'Анталия': 4, 'Никосия': 4, 'Афины': 4, 'Рим': 4, 'Нью-Йорк': 11, 'Вашингтон': 11, 'Лос-Анджелес': 13,
               'Сен-Тропе': 4, 'Рио-де-Жанейро': 14},

    'Екатеринбург': {'Санкт-Петербург': 3, 'Барнаул': 3, 'Владивосток': 9, 'Самара': 2, 'Крым': 4,
                     'Южно-Сахалинск': 11, 'Ростов': 3, 'Киев': 10, 'Минск': 3, 'Баку': 3, 'Ереван': 4, 'Нур-Султан': 8,
                     'Душанбе': 4, 'Ташкент': 3, 'Лондон': 9, 'Амстердам': 8, 'Токио': 15, 'Пекин': 19, 'Нью-Дели': 12,
                     'Анталия': 5, 'Никосия': 5, 'Афины': 9, 'Рим': 9, 'Нью-Йорк': 15, 'Вашингтон': 16,
                     'Лос-Анджелес': 17, 'Сен-Тропе': 9, 'Рио-де-Жанейро': 24},

    'Санкт-Петербург': {'Барнаул': 5, 'Владивосток': 9, 'Самара': 3, 'Крым': 4, 'Южно-Сахалинск': 11, 'Ростов': 3,
                        'Киев': 5, 'Минск': 2, 'Баку': 6, 'Ереван': 4, 'Нур-Султан': 4, 'Душанбе': 5, 'Ташкент': 5,
                        'Лондон': 5, 'Амстердам': 3, 'Токио': 13, 'Пекин': 14, 'Нью-Дели': 10, 'Анталия': 4,
                        'Никосия': 5, 'Афины': 6, 'Рим': 4, 'Нью-Йорк': 12, 'Вашингтон': 14, 'Лос-Анджелес': 14,
                        'Сен-Тропе': 4, 'Рио-де-Жанейро': 19},

    'Барнаул': {'Владивосток': 14, 'Самара': 7, 'Крым': 9, 'Южно-Сахалинск': 16, 'Ростов': 11, 'Киев': 15, 'Минск': 8,
                'Баку': 11, 'Ереван': 11, 'Нур-Султан': 19, 'Душанбе': 17, 'Ташкент': 12, 'Лондон': 14, 'Амстердам': 15,
                'Токио': 22, 'Пекин': 33, 'Нью-Дели': 18, 'Анталия': 12, 'Никосия': 10, 'Афины': 14, 'Рим': 11,
                'Нью-Йорк': 22, 'Вашингтон': 24, 'Лос-Анджелес': 25, 'Сен-Тропе': 12, 'Рио-де-Жанейро': 32},

    'Владивосток': {'Самара': 11, 'Крым': 13, 'Южно-Сахалинск': 2, 'Ростов': 13, 'Киев': 17, 'Минск': 13, 'Баку': 13,
                    'Ереван': 14, 'Нур-Султан': 12, 'Душанбе': 14, 'Ташкент': 11, 'Лондон': 17, 'Амстердам': 16,
                    'Токио': 2, 'Пекин': 12, 'Нью-Дели': 20, 'Анталия': 14, 'Никосия': 19, 'Афины': 17, 'Рим': 16,
                    'Нью-Йорк': 20, 'Вашингтон': 19, 'Лос-Анджелес': 15, 'Сен-Тропе': 19, 'Рио-де-Жанейро': 32},

    'Самара': {'Крым': 5, 'Южно-Сахалинск': 11, 'Ростов': 2, 'Киев': 9, 'Минск': 5, 'Баку': 3,
               'Ереван': 3, 'Нур-Султан': 10, 'Душанбе': 4, 'Ташкент': 3, 'Лондон': 8, 'Амстердам': 8,
               'Токио': 15, 'Пекин': 18, 'Нью-Дели': 10, 'Анталия': 4, 'Никосия': 4, 'Афины': 8, 'Рим': 9,
               'Нью-Йорк': 14, 'Вашингтон': 16, 'Лос-Анджелес': 17, 'Сен-Тропе': 9, 'Рио-де-Жанейро': 24},

    'Крым': {'Южно-Сахалинск': 12, 'Ростов': 1, 'Киев': 12, 'Минск': 6, 'Баку': 8, 'Ереван': 8, 'Нур-Султан': 9,
             'Душанбе': 12, 'Ташкент': 8, 'Лондон': 8, 'Амстердам': 9, 'Токио': 15, 'Пекин': 23, 'Нью-Дели': 12,
             'Анталия': 13, 'Никосия': 12, 'Афины': 9, 'Рим': 10, 'Нью-Йорк': 17, 'Вашингтон': 19, 'Лос-Анджелес': 17,
             'Сен-Тропе': 12, 'Рио-де-Жанейро': 24},

    'Южно-Сахалинск': {'Ростов': 13, 'Киев': 18, 'Минск': 13, 'Баку': 22, 'Ереван': 14, 'Нур-Султан': 13, 'Душанбе': 11,
                       'Ташкент': 11, 'Лондон': 16, 'Амстердам': 15, 'Токио': 3, 'Пекин': 15, 'Нью-Дели': 23,
                       'Анталия': 18, 'Никосия': 19, 'Афины': 18, 'Рим': 15, 'Нью-Йорк': 22, 'Вашингтон': 23,
                       'Лос-Анджелес': 17, 'Сен-Тропе': 18, 'Рио-де-Жанейро': 33},

    'Ростов': {'Киев': 9, 'Минск': 3, 'Баку': 8, 'Ереван': 2, 'Нур-Султан': 7, 'Душанбе': 4,
               'Ташкент': 8, 'Лондон': 8, 'Амстердам': 8, 'Токио': 15, 'Пекин': 22, 'Нью-Дели': 11,
               'Анталия': 3, 'Никосия': 8, 'Афины': 5, 'Рим': 8, 'Нью-Йорк': 15, 'Вашингтон': 16,
               'Лос-Анджелес': 17, 'Сен-Тропе': 8, 'Рио-де-Жанейро': 22},

    'Киев': {'Минск': 7, 'Баку': 4, 'Ереван': 3, 'Нур-Султан': 4, 'Душанбе': 10, 'Ташкент': 5, 'Лондон': 4,
             'Амстердам': 3, 'Токио': 16, 'Пекин': 15, 'Нью-Дели': 9, 'Анталия': 2, 'Никосия': 3, 'Афины': 3,
             'Рим': 3, 'Нью-Йорк': 13, 'Вашингтон': 13, 'Лос-Анджелес': 16, 'Сен-Тропе': 3, 'Рио-де-Жанейро': 18},

    'Минск': {'Баку': 4, 'Ереван': 3, 'Нур-Султан': 4, 'Душанбе': 11, 'Ташкент': 5, 'Лондон': 8,
              'Амстердам': 7, 'Токио': 14, 'Пекин': 18, 'Нью-Дели': 10, 'Анталия': 6, 'Никосия': 7, 'Афины': 7,
              'Рим': 7, 'Нью-Йорк': 10, 'Вашингтон': 13, 'Лос-Анджелес': 14, 'Сен-Тропе': 8, 'Рио-де-Жанейро': 24},

    'Баку': {'Ереван': 8, 'Нур-Султан': 8, 'Душанбе': 10, 'Ташкент': 9, 'Лондон': 6, 'Амстердам': 8, 'Токио': 17,
             'Пекин': 18, 'Нью-Дели': 10, 'Анталия': 3, 'Никосия': 6, 'Афины': 6, 'Рим': 9, 'Нью-Йорк': 16,
             'Вашингтон': 16, 'Лос-Анджелес': 19, 'Сен-Тропе': 8, 'Рио-де-Жанейро': 24},

    'Ереван': {'Нур-Султан': 8, 'Душанбе': 10, 'Ташкент': 9, 'Лондон': 8, 'Амстердам': 7, 'Токио': 14, 'Пекин': 21,
               'Нью-Дели': 11, 'Анталия': 9, 'Никосия': 4, 'Афины': 3, 'Рим': 6, 'Нью-Йорк': 16, 'Вашингтон': 16,
               'Лос-Анджелес': 17, 'Сен-Тропе': 7, 'Рио-де-Жанейро': 20},

    'Нур-Султан': {'Душанбе': 6, 'Ташкент': 2, 'Лондон': 8, 'Амстердам': 10, 'Токио': 22, 'Пекин': 21, 'Нью-Дели': 12,
                   'Анталия': 6, 'Никосия': 9, 'Афины': 9, 'Рим': 12, 'Нью-Йорк': 17, 'Вашингтон': 17,
                   'Лос-Анджелес': 21, 'Сен-Тропе': 9, 'Рио-де-Жанейро': 26},

    'Душанбе': {'Ташкент': 1, 'Лондон': 14, 'Амстердам': 12, 'Токио': 22, 'Пекин': 34, 'Нью-Дели': 10, 'Анталия': 10,
                'Никосия': 9, 'Афины': 10, 'Рим': 13, 'Нью-Йорк': 22, 'Вашингтон': 23, 'Лос-Анджелес': 24,
                'Сен-Тропе': 14, 'Рио-де-Жанейро': 23},

    'Ташкент': {'Лондон': 8, 'Амстердам': 9, 'Токио': 10, 'Пекин': 14, 'Нью-Дели': 3, 'Анталия': 8,
                'Никосия': 8, 'Афины': 8, 'Рим': 10, 'Нью-Йорк': 13, 'Вашингтон': 19, 'Лос-Анджелес': 20,
                'Сен-Тропе': 10, 'Рио-де-Жанейро': 25},

    'Лондон': {'Амстердам': 2, 'Токио': 12, 'Пекин': 12, 'Нью-Дели': 9, 'Анталия': 4, 'Никосия': 5, 'Афины': 4,
               'Рим': 3, 'Нью-Йорк': 9, 'Вашингтон': 9, 'Лос-Анджелес': 11, 'Сен-Тропе': 2, 'Рио-де-Жанейро': 14},

    'Амстердам': {'Токио': 12, 'Пекин': 12, 'Нью-Дели': 8, 'Анталия': 4, 'Никосия': 5, 'Афины': 4,
                  'Рим': 3, 'Нью-Йорк': 11, 'Вашингтон': 9, 'Лос-Анджелес': 11, 'Сен-Тропе': 2, 'Рио-де-Жанейро': 12},

    'Токио': {'Пекин': 8, 'Нью-Дели': 11, 'Анталия': 16, 'Никосия': 17, 'Афины': 17, 'Рим': 15, 'Нью-Йорк': 13,
              'Вашингтон': 13, 'Лос-Анджелес': 10, 'Сен-Тропе': 15, 'Рио-де-Жанейро': 26},

    'Пекин': {'Нью-Дели': 15, 'Анталия': 16, 'Никосия': 17, 'Афины': 11, 'Рим': 15, 'Нью-Йорк': 20,
              'Вашингтон': 20, 'Лос-Анджелес': 12, 'Сен-Тропе': 15, 'Рио-де-Жанейро': 25},

    'Нью-Дели': {'Анталия': 14, 'Никосия': 10, 'Афины': 12, 'Рим': 13, 'Нью-Йорк': 16, 'Вашингтон': 17,
                 'Лос-Анджелес': 19, 'Сен-Тропе': 12, 'Рио-де-Жанейро': 24},

    'Анталия': {'Никосия': 1, 'Афины': 4, 'Рим': 6, 'Нью-Йорк': 14, 'Вашингтон': 14,
                'Лос-Анджелес': 17, 'Сен-Тропе': 6, 'Рио-де-Жанейро': 20},

    'Никосия': {'Афины': 2, 'Рим': 5, 'Нью-Йорк': 15, 'Вашингтон': 16, 'Лос-Анджелес': 18, 'Сен-Тропе': 7,
                'Рио-де-Жанейро': 20},

    'Афины': {'Рим': 3, 'Нью-Йорк': 11, 'Вашингтон': 13, 'Лос-Анджелес': 16, 'Сен-Тропе': 3, 'Рио-де-Жанейро': 18},

    'Рим': {'Нью-Йорк': 19, 'Вашингтон': 13, 'Лос-Анджелес': 15, 'Сен-Тропе': 2, 'Рио-де-Жанейро': 15},

    'Нью-Йорк': {'Вашингтон': 2, 'Лос-Анджелес': 7, 'Сен-Тропе': 10, 'Рио-де-Жанейро': 13},

    'Вашингтон': {'Лос-Анджелес': 6, 'Сен-Тропе': 11, 'Рио-де-Жанейро': 14},

    'Лос-Анджелес': {'Сен-Тропе': 14, 'Рио-де-Жанейро': 15},

    'Сен-Тропе': {'Рио-де-Жанейро': 15},

    'Рио-де-Жанейро': None

}
